app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches" WHERE "matches"."matched_on" = $1  [["matched_on", "2019-07-21"]]
SELECT "matches".* FROM "matches" ORDER BY "matches"."matched_on" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "matches".* FROM "matches" ORDER BY "matches"."matched_on" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @user_id = current_user.id
    all_matches = Match.all.order(matched_on: :asc)
    had_page_attribute_in_url = true

    begin
      page_number = Base64.decode64(params[:puid])
    rescue
      page_number = 1
      had_page_attribute_in_url = false
    end

    first_week_matched = all_matches.first
    last_week_matched = all_matches.last

SELECT DISTINCT "matches"."year_matched" FROM "matches" ORDER BY year_matched ASC
SELECT DISTINCT "matches"."week_matched" FROM "matches" WHERE "matches"."year_matched" = $1 ORDER BY "matches"."week_matched" ASC  [["year_matched", 2019]]
---

    year_org = []

    years = Match.order("year_matched ASC").distinct.pluck(:year_matched)
    weeks_count = 0
    cur_week = 0
    years.each_with_index do |y, index|
      matches = Match.distinct.where(year_matched: y).order(:week_matched).pluck(:week_matched)

SELECT "matches".* FROM "matches" WHERE "matches"."matched_on" = $1  [["matched_on", "2019-07-21"]]
SELECT "user_match_states".* FROM "user_match_states" WHERE "user_match_states"."user_id" = $1 AND "user_match_states"."match_id" = $2 ORDER BY "user_match_states"."id" ASC LIMIT $3  [["user_id", 2], ["match_id", 27], ["LIMIT", 1]]
SELECT "matches"."dd_key" FROM "matches" WHERE "matches"."id" = $1  [["id", 27]]
---
          address_states = []
          if _week_obj[:is_active_week]
            match_records = Match.where(matched_on: d)
            match_records.each do |s|
              user_match_states = UserMatchState.where(user_id: @user_id, match_id: s.id).first
              dd_key = Match.where(id: s.id).pluck(:dd_key)[0]

SELECT "matches".* FROM "matches" WHERE "matches"."address" = $1 LIMIT $2  [["address", "71 FRANEL CRES, Toronto, ON, M9L1B6"], ["LIMIT", 1]]
SELECT "user_match_states".* FROM "user_match_states" WHERE "user_match_states"."match_id" = $1 AND "user_match_states"."user_id" = $2 LIMIT $3  [["match_id", 19], ["user_id", 2], ["LIMIT", 1]]
INSERT INTO "user_match_states" ("match_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["match_id", 17], ["user_id", 2], ["created_at", "2019-10-09 23:07:23.548082"], ["updated_at", "2019-10-09 23:07:23.548082"]]
UPDATE "user_match_states" SET "status" = $1, "updated_at" = $2 WHERE "user_match_states"."id" = $3  [["status", 2], ["updated_at", "2019-10-08 21:48:26.359973"], ["id", 111]]
---
  def update_status
    match = Match.find_by(address: params[:address])
    user_match_state = UserMatchState.find_by(match: match.id, user: current_user.id)
    unless user_match_state
      UserMatchState.create(match: match, user: current_user)
    end
    match.user_match_states.update(status: params[:new_status])

SELECT "matches".* FROM "matches" WHERE "matches"."address" = $1 LIMIT $2  [["address", "68 Abell St, Toronto, ON"], ["LIMIT", 1]]
INSERT INTO "user_match_states" ("match_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["match_id", 20], ["user_id", 2], ["created_at", "2019-10-08 21:48:18.814355"], ["updated_at", "2019-10-08 21:48:18.814355"]]
UPDATE "user_match_states" SET "status" = $1, "updated_at" = $2 WHERE "user_match_states"."id" = $3  [["status", 1], ["updated_at", "2019-10-08 21:48:18.840656"], ["id", 110]]
---
  def mark_link_viewed
    match = Match.find_by(address: params[:address])
    match_state = match.user_match_states[0]
    unless match_state
      UserMatchState.create(match: match, user: current_user)
      match.reload
      match_state = match.user_match_states[0]
    end
    status_updated = false

    if match_state.status === "unviewed"
      match.user_match_states.update(status: "viewed")